//XFERFEEP PROC HLQ=AWS.M2.CARDDEMO
//* *****************************************************************
//* * XFERFEEP - THREE-STEP TRANSFER FEE POSTING PROCEDURE        *
//* *****************************************************************
//STEP010  EXEC PGM=CBXFR01C
//STEPLIB  DD DSN=&HLQ.LOADLIB,DISP=SHR
//DALYTRAN DD DSN=&HLQ.DALYTRAN.PS,DISP=SHR
//XREFFILE DD DSN=&HLQ.CARDXREF.PS,DISP=SHR
//ACCTFILE DD DSN=&HLQ.ACCTDATA.PS,DISP=SHR
//XFEREXTR DD DSN=&HLQ.XFER.EXTRACT(+1),DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//STEP020  EXEC PGM=XFERFEE
//STEPLIB  DD DSN=&HLQ.LOADLIB,DISP=SHR
//XFEREXTR DD DSN=&HLQ.XFER.EXTRACT(0),DISP=SHR
//ACCTFILE DD DSN=&HLQ.ACCTDATA.PS,DISP=SHR
//ACCTOUT  DD DSN=&HLQ.ACCTDATA.XFER(+1),DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)
//XFERFEE  DD DSN=&HLQ.XFER.FEES(+1),DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)
//DB2PARM  DD *
DSN=CARDDEMO PLAN=XFERFEE
/*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//STEP030  EXEC PGM=CBXFR03C,COND=(4,LT,STEP020)
//STEPLIB  DD DSN=&HLQ.LOADLIB,DISP=SHR
//XFERFEE  DD DSN=&HLQ.XFER.FEES(0),DISP=SHR
//XFERRPT  DD DSN=&HLQ.XFER.RECON.RPT(+1),DISP=(NEW,CATLG,DELETE),
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
// PEND
